src/toir_cf/src/Reports/торо_ГрафикРаботыСотрудника/торо_ГрафикРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ГрафикРаботыСотрудника</name>
</mdclass:Report>

src/toir_cf/src/Documents/торо_ПлановаяДоступностьПерсонала/торо_ПлановаяДоступностьПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПлановаяДоступностьПерсонала</name>
  <registerRecords>InformationRegister.торо_СостояниеРаботыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочееВремяСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаГрафика</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>В секундах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСотрудника</name>
      <type>
        <types>CatalogRef.торо_СостоянияСотрудника</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Reports/торо_ГрафикРаботыСотрудника/Forms/ФормаНастроекПечатнойФормы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// При печати из документа "Плановая доступность персонала".
	Если Параметры.Свойство("ПлановаяДоступность") Тогда
		
		РеквизитыПлановойДоступности = торо_ОбщегоНазначенияВызовСервера.ЗначенияРеквизитовОбъекта(
			Параметры.ПлановаяДоступность, "НачалоПланирования, РабочееВремяСотрудников");
			
		ДобавленныеСотрудники = Новый Массив;	
			
		Выборка = РеквизитыПлановойДоступности.РабочееВремяСотрудников.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ДобавленныеСотрудники.Найти(Выборка.Сотрудник) = Неопределено Тогда
				НоваяСтрока = Сотрудники.Добавить();
				НоваяСтрока.Печатать = Истина;
				НоваяСтрока.Сотрудник = Выборка.Сотрудник;
				
				ДобавленныеСотрудники.Добавить(Выборка.Сотрудник);
			КонецЕсли;
		КонецЦикла;	 
		
		Год = НачалоГода(РеквизитыПлановойДоступности.НачалоПланирования);
	КонецЕсли;
	
	// При печати из обработки "Управление плановой доступностью персонала".
	Если Параметры.Свойство("Год") Тогда
		Год = Параметры.Год;
	КонецЕсли;
	
	Если Параметры.Свойство("Сотрудники") Тогда 
		
		Для Каждого Сотрудник Из Параметры.Сотрудники Цикл
			НоваяСтрока = Сотрудники.Добавить();
			НоваяСтрока.Печатать = Истина;
			НоваяСтрока.Сотрудник = Сотрудник;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Год) ИЛИ Сотрудники.Количество() > 0 Тогда
		// Значит эти реквизиты заполнились из параметров.
		Настройки.Удалить("Год");
		Настройки.Удалить("Сотрудники");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.Печатать = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого Значение Из ВыбранноеЗначение Цикл
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.Печатать = Истина;
		НоваяСтрока.Сотрудник = Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элементы.Сотрудники,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиНаПечать(Команда)
	
	Если Не ЗначениеЗаполнено(Год) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Год не заполнен. Печать невозможна.'"));
		Возврат;
	КонецЕсли;	
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из Сотрудники Цикл
		Если Не Строка.Печатать Или Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСотрудников.Добавить(Строка.Сотрудник);
	КонецЦикла;	
	
	Если МассивСотрудников.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одного сотрудника. Печать невозможна.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Год", Год);
	ПараметрыПечати.Вставить("Сотрудники", МассивСотрудников);
		
	торо_Печать.НапечататьДокумент(
		"Отчет.торо_ГрафикРаботыСотрудника", 
		"ГрафикРаботыСотрудника", 
		ПредопределенноеЗначение("Документ.торо_ПлановаяДоступностьПерсонала.ПустаяСсылка"), 
		ПараметрыПечати);

	ЭтотОбъект.Закрыть();	
		
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте 
Процедура УстановитьСнятьФлажки(Значение)
	
	Для Каждого Строка Из Сотрудники Цикл
		Строка.Печатать = Значение;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
